Revit 2027 API
ElementType.CanBeRenamed Property
 Determine if this ElementType can be renamed
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanBeRenamed { get; }
Public ReadOnly Property CanBeRenamed As Boolean
	Get
public:
property bool CanBeRenamed {
	bool get ();
}
member CanBeRenamed : bool with get
Property Value
Boolean
See Also
Reference
ElementType Class
Autodesk.Revit.DB Namespace